gutanclan/stm32Bootloader/Application/DriversMcuPeripherals/sysTick.c
//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//!    \file        sysTick.h
//!    \brief       System tick.
//!
//!    \author
//!    \date
//!
//!    \notes
//!
//!    \defgroup   TypeOfModule   Group Name
//!
//////////////////////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////////////////////
// Header include
//////////////////////////////////////////////////////////////////////////////////////////////////

#include "../inc/stm32f2xx_conf.h"     // Macro: assert_param() for other STM libraries.

#include "../Utils/Types.h"

//////////////////////////////////////////////////////////////////////////////////////////////////
// Macros and Defines
//////////////////////////////////////////////////////////////////////////////////////////////////

#define SYS_TICK_TICKS_PER_SECOND   (1000)

//////////////////////////////////////////////////////////////////////////////////////////////////
// File Local Variables
//////////////////////////////////////////////////////////////////////////////////////////////////

static volatile UINT64  gqdwSysTickCounter;
static volatile UINT32  gdwSysTickCounter;

//////////////////////////////////////////////////////////////////////////////////////////////////
// File Local Functions
//////////////////////////////////////////////////////////////////////////////////////////////////

void SysTick_Handler( void );

///////////////////////////////// FUNCTION IMPLEMENTATION ////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     BOOL SysTickModuleInit( void )
//!
//! \brief  Initialize SysTick variables
//!
//! \param[in]  void
//!
//! \return
//!         - TRUE if no error
//!         - FALSE otherwise
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
BOOL SysTickModuleInit( void )
{
    gqdwSysTickCounter  = 0;
    gdwSysTickCounter   = 0;

    // set the sys tick to interrupt every 1 ms.
    SysTick_Config( SystemCoreClock / SYS_TICK_TICKS_PER_SECOND );

    return FALSE;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     UINT64 SysTickGetTicksSincePowerUpLargeCounter( void )
//!
//! \brief  return the value of the variable that keep track of sys ticks since the system powered up
//!
//! \param[in]  void
//!
//! \return
//!         - UINT64 number of system ticks since the system powered up.
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
UINT64 SysTickGetTicksSincePowerUpLargeCounter( void )
{
    UINT64 qdwSysTickCounter = 0;

    do
    {
        // make sure the variable is copied completely
        qdwSysTickCounter = gqdwSysTickCounter;
    }while( gqdwSysTickCounter != qdwSysTickCounter );

    return qdwSysTickCounter;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     UINT32 SysTickGetTicksSincePowerUpSmallCounter( void )
//!
//! \brief  return the value of the variable that keep track of sys ticks. Variable size UINT32
//!
//! \param[in]  void
//!
//! \return
//!         - UINT32 number of system ticks since the system powered up.
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
UINT32 SysTickGetTicksSincePowerUpSmallCounter( void )
{
    return gdwSysTickCounter;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     UINT32 SysTickGetTickRate( void )
//!
//! \brief  return the value of the system tick rate. (Ticks per second)
//!
//! \param[in]  void
//!
//! \return
//!         - UINT32 sys tick rate(Ticks per second)
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
UINT32 SysTickGetTickRate( void )
{
    return SYS_TICK_TICKS_PER_SECOND;
}

//////////////////////////////////////////////////////////////////////////////////////////////////
//!
//! \fn     void SysTick_Handler( void )
//!
//! \brief  Interrupt Handler
//!
//! \param[in]  void
//!
//! \return     void
//!
//////////////////////////////////////////////////////////////////////////////////////////////////
void SysTick_Handler( void )
{
    gqdwSysTickCounter++;
    gdwSysTickCounter++;
}

